the plan looks ok to me;

```
$ terraform plan
aws_cloudwatch_log_group.atlantis: Refreshing state... [id=atlantis]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:804464997158:cluster/atlantis]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-094742232bd5e527a]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0c0063719053916fd]
aws_iam_role.ecs_task_execution: Refreshing state... [id=atlantis-ecs_task_execution]
aws_ecs_task_definition.atlantis: Refreshing state... [id=atlantis]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e922a5002add8853]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0fbcf07c85bd5e9b0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-030fa5c5a3cdc9b58]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0acf5973d9f72f49e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06d9174ee2483e072]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00b71fec50b5c1ac1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04f3954fdcdc464cc]
module.atlantis_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0c83e7e3cc9716ad4]
module.alb_https_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-09c720ad0136715c1]
module.alb_http_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0ac45ed33679c137b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e922a5002add88531080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05287abddd74bcee6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f95696df900098e8]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04cfcee305e537484]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ffd1a85322b1971c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04dfd242c0959d5d8]
module.alb_http_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1222689245]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2340891955]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3102628661]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-4133695268]
module.alb_https_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1052403968]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3227126067]
module.atlantis_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-690486483]
module.atlantis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-2055104306]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:loadbalancer/app/atlantis/4a255769da024305]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-030fa5c5a3cdc9b581080289494]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:targetgroup/atlantis/eaf0519f7d8751df]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:listener/app/atlantis/4a255769da024305/c5cad1a686632932]
aws_ecs_service.atlantis: Refreshing state... [id=arn:aws:ecs:us-east-1:804464997158:service/atlantis/atlantis]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_access_secrets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_access_secrets"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_ssm_parameter.webhook[0] will be created
  + resource "aws_ssm_parameter" "webhook" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/atlantis/webhook/secret"
      + tags      = {
          + "Name" = "atlantis"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # random_id.webhook[0] will be created
  + resource "random_id" "webhook" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 64
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```
